Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: Review and Approval reviews the planned use of open source in products for distribution and, if mandated by company policy, in internal projects.
ja: 「調査と承認」プロセスでは、社外に提供する自社製品のオープン ソース使用計画について調査します。また、企業ポリシーによって義務付けられる場合は、社内プロジェクトについても調査を実施します。◆◆

source: Companies using FOSS in an externally distributed product must:
ja: 外部に配布する製品に FOSS を使用している企業は、以下の作業を行う必要があります。

source: - Review incoming requests from engineering and product teams for using FOSS and determine approval
ja: - エンジニアリング チームとプロダクト チームからの FOSS使用に関するリクエストをレビューし、承認決定を行う

source: Auditing Source Code
ja: ソース コードの監査

source: - Source code, including modifications (when applicable), has been prepared and is available at the point the product ships
ja: ソースコードが (必要に応じて改変を含めて) 準備されており、製品出荷時点で利用可能であること

source: He has an AB in Engineering Science and an MS in System Simulation from Dartmouth College.
ja: 彼は、ダートマス カレッジにおいて、エンジニアリング サイエンスの AB、およびシステム シミュレーションの MS を取得しています。

source: In addition, IT may get requests from the OSRB to develop tools that will be used to improve the effectiveness or efficiency of the compliance activities.
ja: また、OSRB から、より効率よくコンプライアンス活動を行うためのツールを開発するよう求められる場合もあります。

source: Includes overview for executive management plus in-depth presentations for functional groups identified above in “Who Should Attend?” covering what must be done and recommended approaches to instantiating a compliance process.
ja: エグゼクティブ向けのコースの概要、および「対象者」に含まれる各機能グループ向けの詳細なプレゼンテーション、たとえば、コンプライアンス プロセスをインスタンス化するためにするべきことやお勧めのアプローチなど。

source: Working with compliance inquiries
ja: コンプライアンスに関する照会への対応

source: Companies can use this checklist as a confidential internal tool to assess their progress in implementing a rigorous compliance process and to help them prioritize their process improvement efforts.
ja: 企業は、このチェックリストを社内ツールとして使用することにより、厳格なコンプライアンス プロセス実装の進捗状況を評価でき、プロセス改善活動の優先順位を決定しやすくなります。

source: - Provide support and maintenance for the tools and automation infrastructure used by the compliance program
ja: コンプライアンス プログラムで使用しているツールや自動化基盤をサポートおよびメンテナンスする

source: December 2010
ja: 2010 年 12 月

source: A Guide to the Roles and Responsibilities of Individuals and Teams Involved in Ensuring FOSS Compliance
ja: FOSS コンプライアンスの履行に関わる人々やチームの役割と責任

source: The author would like to express his gratitude to Karen Copenhaver (Legal Director of the Linux
ja: このホワイトベーパーの作成にあたっては、Karen Copenhaver 氏 (Linux Foundation のリーガル ディレクター兼 Choate, Hall & Stewart LLP 社 Business & Technology practice 所属のパートナー) から貴重なレビューとアドバイスをいただきました。ありがとうございました。

source: Failure to audit the source code:
ja: ソース コードの監査不履行:

source: OBS monitors dependencies and continuously integrates changes whenever Packages are checked into the source repository.
ja: OBS は、依存関係を監視し、パッケージがソース リポジトリにチェックインされるたびに、変更点を絶えず統合します。

source: Some observers have expressed concerns that secure boot could be used to exclude open systems from the market, but, as we have shown above, there is no need for things to be that way.
ja: 「secure boot は、市場からオープン システムを排除するために使用されかねない」という懸念の声も聞かれますが、前述のように、そのような心配はありません。

source: Scanning and auditing all the source code components
ja: すべてのソース コード コンポーネントをスキャンおよび監査する

source: Outcomes of the review
ja: 調査の結果

source: - An incoming OSRB form requesting use of a specific FOSS package
ja: 特定の FOSS パッケージの使用を要求する OSRB フォームを受領する

source: a)Compliance activities are mapped against the organization's product development process to identify leverage points.
ja: a) コンプライアンス作業を組織の製品開発プロセスに対応付け、レバレッジ ポイントを特定する。

source: Within these script files they would pass command-line options to the tools to influence the process.
ja: そして、これらのスクリプト ファイルの中で、プロセスを動かすコマンドライン オプションをツールに渡します。

source: This failure occurs when linking software (FOSS, proprietary, 3rd party) that have conflicting and incompatible10 licenses, or if the FOSS has a license with a viral effect11.
ja: この違反は、互換性のないライセンスを持つソフトウェアをリンクするとき、またはその FOSS がバイラル効果を持つライセンスを持っている場合に発生する。

source: More information can be found at http://www.linuxfoundation.org/workgroups/spdx.
ja: 詳細については、下記のページをご覧ください。 http://www.linuxfoundation.org/workgroups/spdx

source: It is simple and straightforward to pass one or a few source code modules to the compilers and linker for processing and create a deployable executable but as software systems grow and include outside binary libraries, resource files, etc. a more flexible way of building is required.
ja: 数個のソース コード モジュールをコンパイラーやリンカーに渡して、デプロイ可能な実行ファイルを作成する場合には、この方法がシンプルで直接的です。しかし、ソフトウェア システムが成長し、外部のバイナリ ライブラリやリソース ファイルを含むようになると、より柔軟なビルド方法が必要になります。

source: - Review and decide on the approval to release IP
ja: IP (知財) のリリースに関する承認のレビューと決定

source: - Execute a brute force scanning for binaries with unknown source
ja: ソース コードのないバイナリ ファイルに対し、ブルート フォース (総当たり) スキャンを実行する

source: Dispatcher
ja: ディスパッチャー

source: The first paper entitled “FOSS Compliance: The Basics You Must Know”, available from the Linux Foundation, provided a discussion on the multi-source development model, the need for compliance, objectives and benefits, the consequences of non- compliance, possible compliance failures, how to avoid them and lessons learned.
ja: 基本概念 (FOSS Compliance: The Basics You Must Know)" というタイトルのホワイトペーパーは、The Linux Foundation の Web サイトからダウンロードできます。第一弾の内容は、マルチソース開発モデル、コンプライアンスの必要性、目的とメリット、コンプライアンス違反が招く結末、コンプライアンス違反の可能性、コンプライアンス違反の回避方法、そこから得られた教訓などです。

source: 23:59 GMT: Preview Finalized
ja: 23:59 (世界標準時): プレビュー終了

source: FAILURE TYPE AND DESCRIPTION
ja: 違反の種類と解説

source: Many new smartphones, including the Motorola Droid X run Android.
ja: Motorola Droid X をはじめとする新しいスマートフォンの多くは Android を使用しています。

source: This software category may include snippets of FOSS or in many cases depends on or links to FOSS.
ja: このソフトウェア カテゴリにも、FOSS の断片が含まれている場合があります。また、多くの場合、FOSS に依存あるいはリンクしています。

source: The debate about the increasing role of open source in the software community is over.
ja: ソフトウェア コミュニティにおけるオープン ソースの役割の増大についての議論は終わりました。

source: UEFI specifies (section 27.5) a Platform Key (PK), which is designed to be controlled by the Platform Owner (whoever owns the hardware) and a set of Key-Exchange Keys (KEKs), which are designed to be controlled by the OEM and OS vendors.
ja: UEFI 仕様 (セクション 27.5) は、プラットフォーム鍵 (PK) と一組の鍵交換鍵 (KEKs) を定義しており、前者はプラットフォーム オーナー (ハードウェアの持ち主) が管理するように設計され、後者は OEM と OS ベンダーが管理するように設計されています。

source: Stay tuned!
ja: しばらくお待ちください。

source: Waysto Train
ja: トレーニングの方法

source: Training Formats
ja: トレーニング フォーマット

source: Copyright owners (if listed)
ja: 著作権所有者 (掲載があれば)

source: The compliance team verifies that OSRB approval has been obtained for all OSS packages in the release.
ja: コンプライアンス チームは、リリース製品内のすべての OSS パッケージについて、OSRB の承認が得られていることを検証する。

source: Booting Closed Operating Systems
ja: クローズド オペレーティング システムのブート

source: - Distributing FOSS including modifications (if any) when applicable
ja: FOSS を配布する (必要に応じ、改変内容を含める)

source: A firmware-based mechanism for easy booting of removable media.
ja: リムーバブル メディアによる簡易ブートのためのファームウェアベースのメカニズムを用意する。

source: - Identify linkages made by software components both at static and dynamic levels
ja: ソフトウェア コンポーネントの静的および動的リンクを識別する

source: A license p is compatible with a license q (or is q-compatible) if A work licensed under p can be distributed under the terms of q.
ja: ライセンス p の下でライセンスされた成果物を ライセンス q の条件下で配布できる場合、ライセンス p はライセンス q と矛盾しません (q と両立 / q 互換)。

source: Conclusions
ja: まとめ

source: Gaining an increased understanding of the benefits of FOSS and how it impacts your organization
ja: FOSS のメリットや、FOSS が組織に及ぼす影響についてよく理解できる

source: What Will You Learn
ja: 学習内容

source: - Assist with licensing-in third party software that is bundled with FOSS packages
ja: FOSS パッケージにバンドルされているサードパーティ ソフトウェアのライセンスイン (ライセンスの購入) をサポートする

source: However, the advantages are undeniable and have been proven many times hence the question is not whether an organization can afford a deploying a build system but whether it cannot.
ja: しかし、その利点は明白で、何度も証明されているため、問題は、組織がビルド システムをデプロイできる余裕があるかどうかではなく、できないかどうかです。

source: The Code Janitor Tool
ja: コード管理ツール (Code Janitor Tool)

source: Marketing, Sales, and Customer Support
ja: マーケティング、セールス、顧客サポート

source: f)The OSRB uses independent analysis methods to confirm the OSS content reported by teams when they submit an OSS use case for approval.
ja: f) OSRB は、チームから OSS 使用の承認要求が提出されたら、独立した分析メソッドを使用して、チームから提出された OSS の内容を確認すること。

source: The signature database will be inactive while the platform is in setup mode, but, once secure boot is activated, the firmware and all of the add in driver components must validate correctly for the platform to progress to boot the Operating System (since elements of the Firmware come from add in cards, getting the complete set of KEKs is problematic, but we’ll address that later).
ja: この署名データベースは、プラットフォームが setup モードにあるときは非アクティブですが、secure boot がアクティベートされると、ファームウェアとすべての拡張ドライバー コンポーネントが適切に認証を行い、OS の起動を進めます (ファームウェアのエレメントが拡張カードに存在すると、鍵交換鍵の一式を取得するのが問題ですが、これについては後ほど触れます)。

source: This one-shot analysis method imposes the limitation that the file to analyze cannot be an archive file needing to be unpacked, such as a tar or a jar file.
ja: 単発解析の場合は、tar ファイルや jar ファイルのように解凍が必要なアーカイブ ファイルは解析できません。

source: Figure 5 illustrates the concept of incremental compliance whereby you need to ensure compliance of whatever source code changes that took place in between the initial compliant base line and the current version.
ja: 図 5 は、インクリメンタル コンプライアンスの概念を表したもので、これによって、最初のコンプライアントなベースラインと現在のバージョンの間に起こったすべてのソース コードの変化のコンプライアンスを確認する必要を示しています。

source: In fact, FOSSology is shipped with an empty database and file repository.
ja: 実際、配布時の FOSSology には、空のデータベースとファイル リポジトリしか付属していない。

source: Understanding of software fundamentals and awareness of company engineering and business processes
ja: ソフトウェアの基礎知識、および企業の技術プロセスとビジネス プロセスの認識

source: Meld, a general embedded Linux community
ja: Meld、general embedded (汎用組込み) Linux コミュニティ

source: Why is it called “Self-Assessment”?
ja: なぜ「自己診断」と呼ぶのか

source: In general this is a good thing but for those scanning their version control systems, it results in pretty much a waste of disk space.
ja: 通常ならば、これは良いことだが、バージョン管理システムにとっては、ディスク スペースをかなり無駄遣いすることになる。

source: With the introduction of FOSS to what once were pure proprietary software stacks, the business environment diverged from familiar territory and corporate comfort zones (Figure 3).
ja: これまで純粋なプロプライエタリ ソフトウェア スタックだったところに FOSS を加えると、ビジネス環境は、慣れ親しんだ世界とは少し異なるものになります (図 3)。

source: He is originator of the FOSSology project and can be contacted at bobg@fossology.org.
ja: FOSSology プロジェクトの創設者です。連絡先アドレスは、bobg@fossology.org です。

source: Maintain a Change Log in Each Modified FOSS
ja: 改変された各 FOSS の変更記録を保守する

source: Those just starting down the road of establishing a compliance program would especially benefit from The Linux Foundation's training courses on Open Source compliance rather than relying solely on this checklist.
ja: コンプライアンス プログラムの履行を開始したばかりであれば、このチェックリストを単独で使用するよりも、The Linux Foundation のオープン ソース コンプライアンス トレーニング コースを受講するとより効果的でしょう。

source: The Dependency Checker Tool was released by the Linux Foundation (under the MIT license) as a part of the Open Compliance Program to help companies and individuals with their compliance due diligence.
ja: 依存状態チェッカー ツールは、企業や個人のコンプライアンス精査を支援するために、The Linux Foundation により、オープン コンプライアンス プログラムの一環としてリリースされました。

source: - Proprietary software added to the software platform
ja: ソフトウェア プラットフォームにプロプライエタリ ソフトウェアが追加された

source: - Respond quickly to all compliance related questions
ja: あらゆるコンプライアンス関連の疑問に迅速に対応する

source: (Minor deviations, though significant and requiring corrective actions, could be numerous but still not present a certification obstacle.
ja: (小さな偏差も重要であり、正しい対処が必要ですが、大量にあっても認定の障害にはなりません。◆◆

source: http://www.linuxfoundation.org/programs/legal/compliance/training-and-education.
ja: http://www.linuxfoundation.jp/programs/legal/compliance/training-and-education

source: In addition, part of the pre-distribution verification is to ensure that:
ja: 配布前の検証では、以下について確認します。

source: This is a huge need in today’s market where it’s often times difficult for open source projects to identify the correct people at companies using their software to address issues of concern.
ja: 今日の市場において、オープンソース プロジェクトが彼らの OSS を使用している企業の担当者を見つけ出し、懸念事項について協議することは難しいため、このような連絡簿の必要性が叫ばれていました。

source: A mechanism is used to determine whether any of the organization's business units object to the proposed contribution.
ja: 提案された貢献に異論を唱えている組織内事業体があるかどうかを確認するメカニズムを用意すること。

source: Formal training mandated to all employees working with FOSS.
ja: 公式トレーニング: FOSS に関わるすべての従業員に義務付けられる。

source: There are three main sources for incoming source code:
ja: 組織が利用するソース コードの出自は、大きく分けて 3 種類あります。

source: This failure occurs when the OSRB fail to audit the source code incoming into the build system.
ja: この違反は、OSRB がビルド システムに追加するソース コードの監査を行わなかったときに発生する。

source: The approval comes from the OSRB, which includes Legal Counsel, Engineering representative and FOSS expert.
ja: この承認は、OSRB が行います。OSRB は、法律顧問、エンジニアリング部門代表者、FOSS エキスパートなどで構成されます。

source: d)Verification activities assure that all OSS packages to be distributed have been approved by the OSRB.
ja: d) 配布予定のすべての OSS パッケージが OSRB によって承認されていることを保証するために検証作業を行うこと。

source: The easiest way of running an individual instance is to start with an OBS appliance.
ja: 個々のインスタンスを最も簡単に実行する方法は、OBS アプライアンスで開始することです。

source: Google hosts many project discussions
ja: Google: 各種のプロジェクト ディスカッションを収載

source: In the absence of the establishment of a trust model, we therefore recommend that non-verifying external media be booted with a simple firmware based present user permission check when the system is in user mode with secure boot enabled.
ja: したがって、システムがユーザー モードでかつ secure boot が有効な状態では、現行のシンプルなハードウェア ベースのユーザー権限チェックを行って、外部の非認証メディアをブートするのがよいでしょう。

source: Buckets
ja: バケット

source: Additionalcomplianceresources
ja: その他のコンプライアンス リソース

source: Although most software licenses convey intent, the SPDX(TM) effort is focusing on getting at facts.
ja: 通常、ソフトウェア ライセンスは開発者の意図を伝えるものですが、SPDX(TM) 活動は事実を伝えることに重点を置いています。

source: Example of a license notice (for rsync2):
ja: ライセンス告知の例 (rync2 の場合)

source: - Performing final verifications in relation to distribution
ja: 配布に関連する最終確認を行う

source: The copyright/email/url scanner in v 1.2 of FOSSology does get many false positives, some of which you can see in Figure 6.
ja: FOSSology の v 1.2 の著作権情報/電子メール/URL スキャナーは、図 6 のように、偽陽性を多く検出します。

source: ILLUSTRATION OF THE ARCHITECTURE OF A MODERN SOFTWARE PLATFORM SHOWING THE PROLIFERATION OF FOSS INSIDE EACH OF THE PLATFORM SOFTWARE BUILDING BLOCKS
ja: 現代のソフトウェア プラットフォームのアーキテクチャ - プラットフォームの各ソフトウェア要素の中で FOSS が増えている

source: Suppliers will also benefit by having to prepare only one disclosure for their multiple customers.
ja: またサプライヤーにとっても、共通のフォーマットで複数の顧客に情報を公開できるので便利です。

source: Audience and Intended Purpose for the Self-Assessment Checklist
ja: 自己診断チェックリストの閲覧者と本来の目的

source: The publisher's responsibility is to make binary packages available to users for download and installation on their computers.
ja: パブリッシャーの責任は、バイナリ パッケージを、ユーザーが各自のコンピューターにダウンロードおよびインストールできるようにすることです。

source: The OSRB guidelines typically cover:
ja: OSRB のガイドラインは、通常、次のような内容になります。

source: Traditionally, platforms and software stacks were implemented using proprietary software and consisted of various software building blocks that came from different 3rd party software providers with negotiated licensing terms (Figure 1).
ja: これまで、プラットフォームやソフトウェア スタックは、プロプライエタリなソフトウェアを使用して実装され、さまざまなサード パーティのソフトウェア提供者との交渉によるライセンス契約に基づいて入手したソフトウェア要素で構成されていました (図 1)。

source: Such chicken-and-egg first-boot problems can be avoided if all OS vendors participate in a chain of trust which allows validated root signatures to be present in the UEFI signature database ab initio (see later).
ja: すべての OS ベンダーが信頼の連鎖に加わり、有効なルート署名が最初から UEFI 署名データベースに入るようになれば、このような初期ブートの問題は避けることができます(「信頼モデルの確立」の章を参照)。

source: Due to the large number of verification steps, it is essential to develop, maintain and evolve checklists that cover all the verification steps the compliance team follows to ensure consistency and to ensure that no verification steps are overlooked.
ja: 検証にはいくつもの作業が含まれているため、コンプライアンス チームが行うすべての検証作業のチェックリストを作成し、随時改訂して、一貫性を保ち、検証作業の見落としを防ぐことが大切です。

source: Therefore, it is a necessity to continuously review compliance policies and processes and introduce improvements.
ja: したがって、コンプライアンス ポリシーおよびプロセスを継続的にレビューし、改善する必要があります。

source: Recording a summary of the discussions that lead to the decision of approval or denial.
ja: 承認または否認に至った検討の概要を記録します。

source: Gaining an increased understanding of the costs and risks associated with using FOSS
ja: FOSS の利用に伴うコストやリスクについてよく理解できる

source: Appropriately, an organization will adapt its compliance approach based upon the nature and amount of the open source it uses, the licenses that apply to open source it uses, the kinds of products it distributes, and the design of the product itself.
ja: 各組織は、それぞれが使用するオープン ソースの性質や量、それらのオープン ソースに適用される各ライセンス、および製品そのものの設計に応じて、コンプライアンス アプローチを適切に適合させてください。

source: It consists of scanning the source code using automated source code analysis tools to discover source code matching FOSS source code.
ja: ソース コード自動解析ツールを使用してソース コード スキャンし、FOSS ソース コードと一致するソース コードを検出します。

source: Language forthe standard softwarein-licensingagreement
ja: ライセンス契約における標準ソフトウェアのための文言

source: Compliance Challenges and Solutions
ja: コンプライアンスの課題と解決策

source: It takes skill and care to correctly build binaries from sources, assemble packages from binaries and layout images from packages.
ja: ソースからバイナリを正確にビルドし、バイナリからパッケージを作成し、パッケージからイメージを生成するには、スキルと注意が必要です。

source: Dependency Checker Tool Overview
ja: 依存状態チェッカー ツール (Dependency Checker Tool) (英語)

source: Members of the Extended Team
ja: 拡張チームのメンバー

source: Generate detailed reports of the build process.
ja: ビルド プロセスの詳細レポートを生成する。

source: A compliance strategy drives a business-based consensus on the main aspects of the policy and process implementation.
ja: コンプライアンス戦略は、ポリシーおよびプロセス実装の主要面においてビジネスベースの合意形成を推進します。

source: This demo server has many FOSS projects already loaded into its repository.
ja: このデモ サーバーのリポジトリには、すでに数多くの FOSS プロジェクトがロードされています。

source: The Linux Foundation has developed an extensive checklist of compliance best practices in addition to elements that must be available in an open source compliance program to ensure its success.
ja: The Linux Foundationでは、OSS コンプライアンス プログラムを成功に導くさまざまな要素に加え、コンプライアンスのベスト プラクティス (成功事例) を集めた自己診断チェックリストを開発しました。

source: Attend a Conference
ja: カンファレンスに参加する

source: b)Involvement of support functions is planned, scheduled, and performed in a timely manner.
ja: b) サポート チームの行うべきことをタイムリーに計画し、スケジュールを組み、実行すること。

source: Furthermore, open interfaces allow easy integration with different clients and external services.
ja: また、オープンなインタフェースのため、異なるクライアントや外部サービスとの統合が容易です。
